#include	"timer.h"

/***********************
功能描述：定时器0初始化
入口参数：无
返回值：无
作用：对串口1进行帧结束的空闲检测，3.5个波特时长，
************************/
void Timer0Init(void)
{
	TMOD &= 0x00;                    //定时器0设置为定时方式16位自装载
	AUXR |= 0x80;                    //设置定时器0为1T模式

	
	TL0 = (65536-T1TMS);              //1T模式下初始装载值 
	TH0 = (65536-T1TMS) >> 8;         //1T模式下初始装载值 
	//AUXR |= 0x10;                    //打开定时器0，开始运行 
	//AUXR &= 0xEF;                    //关闭定时器0，停止运行  

	TR0 = 1; 
	ET0 = 1;													//使能定时器0中断
	//EA = 1;	                   				
}

/**************************************
功能描述：定时器0中断服务程序
入口参数：无
返回值：无
***************************************/
void timer0_int (void) interrupt TIMER0_VECTOR
{

	TR0 = 0;     		//超时关闭定时器
	
	if(Recv_Cnt >= 7)  		//常用最少7个字节
	{ 
			Recv_OK  = 1;     //主程序处理接收数据标志
			LED_B = ~LED_B;  
			REN = 0;					//关闭串口接收，在处理程序中再开串口接收
	}else Recv_Cnt = 0;		//否则丢弃

}

/***********************
功能描述：定时器2初始化
入口参数：无
返回值：无,在串口1初始化中进行初始化，作为波特率发生器
************************/


/*********************************END FILE********************************************/	

	
